app/controllers/posts_controller.rb

  def index
    @posts = Post.includes(:author)
                 .page(params[:page])
                 .per(params[:rows])
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "desc", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Bai hoc dau tien"], ["desc", "Oi bai hoc dau tien"], ["created_at", "2023-07-22 04:38:29.113829"], ["updated_at", "2023-07-22 04:38:29.113829"]]