app/controllers/users_controller.rb

UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Tuan 2"], ["email", "1235"], ["updated_at", "2023-07-22 04:22:45.301345"], ["id", 5]]
---
  def update
    if @user.update(user_params)